
# 1. Составьте программу в которой объявите две строковые переменные
string1 = "This is a string."
string2 = " This is another string."
# 2. Проверьте работу операции «+» со строками.
string3 = string1 + string2
print(string3)

